app/Controllers/Admin/AboutController.php

SELECT *
FROM `about`
 LIMIT 1
---
    public function index()
    {
        $aboutModel = new AboutModel();
        $about = $aboutModel->first(); // We assume one row

SELECT *
FROM `about`
 LIMIT 1
---
    public function update()
    {

        helper(['form']);

        $aboutModel = new \App\Models\AboutModel();

        // Get the existing record
        $about = $aboutModel->first();

UPDATE `about` SET `title` = 'About Chaplibites!!', `description` = 'Discover the story behind our passion for fresh, delicious, and eco-friendly veggie delights.', `story` = 'Founded in 2020, Chaplibites started as a small family-run eatery with a big dream: to make veggie burgers that are as delicious as they are sustainable. Inspired by local farms and fresh ingredients, we crafted a menu that celebrates flavor and community.\r\n\r\nToday, we’re proud to serve crispy, crunchy, and veggie-packed meals that bring people together, all while staying true to our eco-friendly roots.', `mission` = 'To create mouthwatering veggie meals using locally sourced, organic ingredients, while fostering a sustainable and community-driven food culture.', `sustainability_text` = 'We partner with local farms to reduce our carbon footprint and ensure fresh, organic ingredients.', `community_text` = 'We support local initiatives and engage with our customers to build a vibrant food community.', `quality_text` = 'Every bite is crafted with care, ensuring delicious flavors and nutritional value.\r\n\r\n', `cta_title` = 'Join the Chaplibites Community', `cta_text` = 'Ready to enjoy fresh, veggie-packed meals? Order now or connect with us on social media!\r\n\r\n', `banner_image` = 'uploads/about/1745309876_4ed1ca298692243d7906.png', `story_image` = '', `sustainability_icon` = '', `community_icon` = '', `quality_icon` = ''
WHERE `about`.`id` IN ('2')
---
        log_message('debug', 'Submitted About update data: ' . json_encode($data));

        // Perform update
        $updated = $aboutModel->update($about['id'], $data);