app/Controllers/Admin/BannerSectionController.php

 public function index()
 {
  $model = new BannerSectionModel();
  $data['banner'] = $model->first();
---
SELECT *
FROM `banner_section`
 LIMIT 1