app/Controllers/Admin/ContactPageController.php

 public function index()
 {
  $model = new ContactPageModel();
  $data['contact'] = $model->first();
---
SELECT *
FROM `contact_page`
 LIMIT 1

 public function update()
 {
  helper(['form', 'url']);
  $model = new \App\Models\ContactPageModel();
  $contact = $model->first(); // assuming one row
---
SELECT *
FROM `contact_page`
 LIMIT 1