app/Controllers/Admin/GalleryController.php

SELECT *
FROM `gallery`
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `gallery`
---
 public function index()
 {
  $model = new GalleryModel();

  $perPage = 8;
  $data['gallery'] = $model->paginate($perPage);