app/Controllers/Admin/HeroSectionController.php

SELECT *
FROM `hero_section`
 LIMIT 1
---
 public function index()
 {
  $model = new HeroSectionModel();
  $data['hero'] = $model->first(); // Only one row expected