app/Controllers/Admin/HotItemsController.php

SELECT *
FROM `hot_items`
---
 public function index()
 {
  $model = new HotItemsModel();
  $data['items'] = $model->findAll();