app/Controllers/Admin/WhoWeAreController.php

 public function index()
 {
  $model = new WhoWeAreModel();
  $data['who'] = $model->first();
---
SELECT *
FROM `who_we_are`
 LIMIT 1