app/Controllers/Auth.php

 public function loginPost()
 {
  helper(['form']);

  if ($this->request->getMethod() === 'POST') {
   $email    = $this->request->getPost('email');
   $password = $this->request->getPost('password');

   $userModel = new \App\Models\UserModel();
   $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'jawadalizada1@gmail.com'
 LIMIT 1

 public function sendResetLink()
 {
  $email = $this->request->getPost('email');
  $user = (new UserModel())->where('email', $email)->first();

  if (!$user) {
   return redirect()->back()->with('error', 'Email not found.');
  }

  $token = bin2hex(random_bytes(50));

  // Save token to database
  $db = db_connect();
  $db->table('password_reset_tokens')->insert([
   'email' => $email,
   'token' => $token,
   'created_at' => date('Y-m-d H:i:s'), // Optional, for expiration
  ]);
---
SELECT *
FROM `users`
WHERE `email` = 'jawadalizada1@gmail.com'
 LIMIT 1
INSERT INTO `password_reset_tokens` (`email`, `token`, `created_at`) VALUES ('jawadalizada1@gmail.com', '17c7d113e8d585881d3eb0c38382a7430c7f9aaf38666266eaed0a4e955cb84f1b7d97f9fd5df1943d31aab76d0098a65266', '2025-04-23 21:27:01')

 public function resetPasswordPost()
 {
  $token = $this->request->getPost('token');
  $password = $this->request->getPost('password');
  $confirm = $this->request->getPost('confirm_password');

  if ($password !== $confirm) {
   return redirect()->back()->with('error', 'Passwords do not match.');
  }

  $db = db_connect();
  $row = $db->table('password_reset_tokens')->where('token', $token)->get()->getRow();

  if (!$row) {
   return redirect()->to('/forgot-password')->with('error', 'Invalid token.');
  }

  $model = new UserModel();
  $model->where('email', $row->email)->set(['password' => password_hash($password, PASSWORD_DEFAULT)])->update();

  $db->table('password_reset_tokens')->where('token', $token)->delete();
---
SELECT *
FROM `password_reset_tokens`
WHERE `token` = '5db8f293b23eee6ba5ab8841bc9815598cb96e7219b605b57a3ba362f11437314b342dae37c152c89dbbcf4a1bd435e672a8'
UPDATE `users` SET `password` = '$2y$10$HrpP6Z0JZzRu84PhlqX0geUfIS.riZjrSQAFzwyPY.e4BigRx5NSW', `updated_at` = '2025-04-23 21:24:29'
WHERE `email` = 'notification@chaplibitesgrill.com'
DELETE FROM `password_reset_tokens`
WHERE `token` = '5db8f293b23eee6ba5ab8841bc9815598cb96e7219b605b57a3ba362f11437314b342dae37c152c89dbbcf4a1bd435e672a8'