app/Controllers/Pages.php

SELECT *
FROM `hot_items`
SELECT *
FROM `hero_section`
 LIMIT 1
SELECT *
FROM `banner_section`
 LIMIT 1
SELECT *
FROM `who_we_are`
 LIMIT 1
SELECT *
FROM `how_it_works`
SELECT *
FROM `testimonials`
SELECT *
FROM `gallery`
 LIMIT 6
---
  public function home()
  {
    // hero section data
    $heroModel = new HeroSectionModel();
    $data['hero'] = $heroModel->first(); // or ->find(1) if you know it's a single row
    //  hot items section data
    $hotItemModel = new HotItemsModel();
    $data['hotItems'] = $hotItemModel->findAll();
    // homepage banner
    $bannerModel = new BannerSectionModel();
    $data['bannerSection'] = $bannerModel->first();

    // who we are
    // Load Who We Are data
    $whoModel = new WhoWeAreModel();
    $data['who'] = $whoModel->first();
    // how it works
    $howItWorksModel = new HowItWorksModel();
    $data['howItWorks'] = $howItWorksModel->findAll();
    // testimonials
    $tesmodel = new TestimonialModel();
    $data['testimonials'] = $tesmodel->findAll();
    // gallery
    $Gmodel = new GalleryModel();
    $data['gallery'] = $Gmodel->limit(6)->find();

SELECT *
FROM `contact_page`
 LIMIT 1
---

    if ($this->request->getMethod() === 'GET') {
      $model = new ContactPageModel();
      $data['contact'] = $model->first();

SELECT *
FROM `about`
 LIMIT 1
---
  public function about()
  {

    $aboutModel = new AboutModel();
    $about = $aboutModel->first(); // We assume one row